<a href="https://colab.research.google.com/github/dhruvUpmanyu-01/Supervised-Learning/blob/main/Lab2_Dhruv_Upmanyu.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Write a program to implement mean absolute error and mean square error on the list of over and runs.

Calculate the mean absolute error and mean square error.

In [ ]:
overs = [3,6,9,12,15,18,20]
actual_run = [15,28,63,90,120,152,190]

w = float(input("Enter the value of w : "))
b = float(input("Enter the value of b : "))

a = []

sum = 0
sum_square = 0
for i in range(len(overs)) :
    y = w*overs[i] + b
    a.append(y)
    sum = sum + abs(actual_run[i] - y)
    sum_square = sum_square + (actual_run[i] - y)**2

print("Actual Output : " , actual_run)
print("Predicted Output : " , a)
MAE = sum/len(overs)
MSE = sum_square/len(overs)

print("Mean Square Error : ",MSE)
print("Mean Absolute Error : ",MAE)

Enter the value of w : 2
Enter the value of b : 0
Actual Output :  [15, 28, 63, 90, 120, 152, 190]
Predicted Output :  [6.0, 12.0, 18.0, 24.0, 30.0, 36.0, 40.0]
Mean Square Error :  7253.428571428572
Mean Absolute Error :  70.28571428571429

Calculate the mean absolute error and mean square error for 4 values of w at the same time.

In [ ]:
overs = [3,6,9,12,15,18,20]
actual_run = [15,28,63,90,120,152,190]

b = 0

def error(w, b):
    a = []

    sum = 0
    sum_square = 0
    for i in range(len(overs)):
        y = w * overs[i] + b
        a.append(y)
        sum += abs(actual_run[i] - y)
        sum_square += (actual_run[i] - y) ** 2

    print(a)
    MAE = sum / len(overs)
    MSE = sum_square / len(overs)

    return MAE, MSE

w = [2, 4, -0.5, -3]

for k in w:
    MAE, MSE = error(k, b)
    print("Mean Square Error:", MSE)
    print("Mean Absolute Error:", MAE)

[6, 12, 18, 24, 30, 36, 40]
Mean Square Error: 7253.428571428572
Mean Absolute Error: 70.28571428571429
[12, 24, 36, 48, 60, 72, 80]
Mean Square Error: 3516.8571428571427
Mean Absolute Error: 46.57142857142857
[-1.5, -3.0, -4.5, -6.0, -7.5, -9.0, -10.0]
Mean Square Error: 13883.25
Mean Absolute Error: 99.92857142857143
[-9, -18, -27, -36, -45, -54, -60]
Mean Square Error: 22689.85714285714
Mean Absolute Error: 129.57142857142858

In [ ]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

no matter how many external indexes we create an internal index is a always be created

In [ ]:
ser_1 = Series([1,1,2,-3,-5,8,13])
ser_1

0     1
1     1
2     2
3    -3
4    -5
5     8
6    13
dtype: int64

In [ ]:
ser_1.values

array([ 1,  1,  2, -3, -5,  8, 13])

In [ ]:
ser_2 = Series([1,1,2,-3,-5], index = ['a','b','c','d','e'])
ser_2

a    1
b    1
c    2
d   -3
e   -5
dtype: int64

In [ ]:
ser_2[4] == ser_2["e"]

<ipython-input-40-4cc59da6e13b>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser_2[4] == ser_2["e"]

True

In [ ]:
ser_2[['c','a','b']]

c    2
a    1
b    1
dtype: int64

In [ ]:
ser_2[ser_2 > 0]

a    1
b    1
c    2
dtype: int64

In [ ]:
ser_2 * 2

a     2
b     2
c     4
d    -6
e   -10
dtype: int64

In [ ]:
np.exp(ser_2)

a    2.718282
b    2.718282
c    7.389056
d    0.049787
e    0.006738
dtype: float64

In [ ]:
dict_1 = {'foo': 100, 'bar': 200, 'baz': 300}
ser_3 = Series(dict_1)
ser_3

foo    100
bar    200
baz    300
dtype: int64

In [ ]:
index = ['foo', 'bar', 'baz', 'qux']
ser_4 = Series(dict_1, index = index)
ser_4

foo    100.0
bar    200.0
baz    300.0
qux      NaN
dtype: float64

isnull() will check if there are any null values in the series.

In [ ]:
pd.isnull(ser_4)

foo    False
bar    False
baz    False
qux     True
dtype: bool

In [ ]:
ser_1 + ser_4

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
bar   NaN
baz   NaN
foo   NaN
qux   NaN
dtype: float64

In [ ]:
ser_4.name = "foobarbazqux"
ser_4.index.name = "label"
ser_4

label
foo    100.0
bar    200.0
baz    300.0
qux      NaN
Name: foobarbazqux, dtype: float64

loc works with custom indexes and iloc works with internal indexes

loc also includes the first element and the last element

In [ ]:
ser_4.loc['bar':'baz']

label
bar    200.0
baz    300.0
Name: foobarbazqux, dtype: float64

In [ ]:
data_1 = {'state' : ['VA','VA','VA','MD','MD'],
          'year' : [2012,2013,2014,2014,2015],
          'pop' : [5.0,5.1,5.2,4.0,4.1]}

df_1 = DataFrame(data_1)
df_1

  state  year  pop
0    VA  2012  5.0
1    VA  2013  5.1
2    VA  2014  5.2
3    MD  2014  4.0
4    MD  2015  4.1

In [ ]:
df_1["state"]

0    VA
1    VA
2    VA
3    MD
4    MD
Name: state, dtype: object

In [ ]:
df_1.state

0    VA
1    VA
2    VA
3    MD
4    MD
Name: state, dtype: object

write a program in python to print the series of prime numbers from 1 to 300

In [ ]:
l = []
for i in range(2,301):
    for j in range(2,i):
        if i % j == 0:
            break
    else:
        l.append(i)

l = pd.Series(l)
l

0       2
1       3
2       5
3       7
4      11
     ...
57    271
58    277
59    281
60    283
61    293
Length: 62, dtype: int64

Print the fibanacci Series.

In [ ]:
a = 0
b = 1

l = [0,1]

for i in range(100):
    c = a + b
    if c > 100:
        break
    l.append(c)
    a = b
    b = c

fibonacci = Series(l)
fibonacci

0      0
1      1
2      1
3      2
4      3
5      5
6      8
7     13
8     21
9     34
10    55
11    89
dtype: int64

In [ ]:
l = []

for i in range(1,21):
    l.append(int(input("Enter the number : ")))

sum = 0
for i in l:
    sum = sum + i
print(sum)

max = l[0]
for i in l:
    if max < i:
        max = i
print(max)

min = l[0]
for i in l:
    if min > i:
        min = i
print(min)

Enter the number : 4
Enter the number : 3
Enter the number : 2
Enter the number : 1
Enter the number : 5
Enter the number : 6
Enter the number : 7
Enter the number : 8
Enter the number : 9
Enter the number : 10
Enter the number : 11
Enter the number : 12
Enter the number : 13
Enter the number : 14
Enter the number : 15
Enter the number : 20
Enter the number : 19
Enter the number : 18
Enter the number : 17
Enter the number : 16
210
20
1